MikroElektronika/core_packages/RX/gcc/def/renesas/R5F572MNHDBG/mcu.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACL : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACL : 24;
#endif
	} BIT;
	} PPMACRL;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACU : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACU : 24;
#endif
	} BIT;
	} PDMACRU;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACL : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACL : 24;
#endif
	} BIT;
	} PDMACRL;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TYPE : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long TYPE : 16;
#endif
	} BIT;
	} PETYPER;
	char           wk9[12];
	unsigned long  PPIPR;
	unsigned long  PDIPR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EVTO : 8;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long EVTO : 8;
#endif
	} BIT;
	} PETOSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GETO : 8;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long GETO : 8;
#endif
	} BIT;
	} PGTOSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PRTL : 8;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long PRTL : 8;
#endif
	} BIT;
	} PPTTLR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PDTL : 8;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long PDTL : 8;
#endif
	} BIT;
	} PDTTLR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EVUPT : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long EVUPT : 16;
#endif
	} BIT;
	} PEUDPR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GEUPT : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long GEUPT : 16;
#endif
	} BIT;
	} PGUDPR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SEL : 1;
			unsigned long PRT : 1;
			unsigned long ENB : 1;
			unsigned long  : 13;
			unsigned long EXTPRM : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long EXTPRM : 1;
			unsigned long  : 13;
			unsigned long ENB : 1;
			unsigned long PRT : 1;
			unsigned long SEL : 1;
#endif
	} BIT;
	} FFLTR;
	char           wk10[28];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACU : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACU : 24;
#endif
	} BIT;
	} FMAC0RU;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACL : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACL : 24;
#endif
	} BIT;
	} FMAC0RL;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACU : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACU : 24;
#endif
	} BIT;
	} FMAC1RU;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACL : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACL : 24;
#endif
	} BIT;
	} FMAC1RL;
	char           wk11[80];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ASYMU : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long ASYMU : 16;
#endif
	} BIT;
	} DASYMRU;
	unsigned long  DASYMRL;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EGP : 16;
			unsigned long INGP : 16;
#else
			unsigned long INGP : 16;
			unsigned long EGP : 16;
#endif
	} BIT;
	} TSLATR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TCYC : 8;
			unsigned long  : 4;
			unsigned long SBDIS : 1;
			unsigned long  : 3;
			unsigned long FILDIS : 1;
			unsigned long  : 3;
			unsigned long TCMOD : 1;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long TCMOD : 1;
			unsigned long  : 3;
			unsigned long FILDIS : 1;
			unsigned long  : 3;
			unsigned long SBDIS : 1;
			unsigned long  : 4;
			unsigned long TCYC : 8;
#endif
	} BIT;
	} SYCONFR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FORM0 : 1;
			unsigned long FORM1 : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long FORM1 : 1;
			unsigned long FORM0 : 1;
#endif
	} BIT;
	} SYFORMR;
	unsigned long  RSTOUTR;
} st_eptpc0_t;

typedef struct st_esc {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESCRST : 1;
			unsigned long PHYRST : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long PHYRST : 1;
			unsigned long ESCRST : 1;
#endif
	} BIT;
	} ESCRST;
	char           wk0[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LINKPOL0 : 1;
			unsigned long LINKPOL1 : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long LINKPOL1 : 1;
			unsigned long LINKPOL0 : 1;
#endif
	} BIT;
	} PHYLINK;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SYNC0C : 1;
			unsigned long SYNC1C : 1;
			unsigned long ESCIC : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long ESCIC : 1;
			unsigned long SYNC1C : 1;
			unsigned long SYNC0C : 1;
#endif
	} BIT;
	} ESCICR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long OFFSET : 5;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long OFFSET : 5;
#endif
	} BIT;
	} PHYOFF;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PROMSIZE : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long PROMSIZE : 1;
#endif
	} BIT;
	} ESCMR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TXSFT0 : 2;
			unsigned long TXSFT1 : 2;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long TXSFT1 : 2;
			unsigned long TXSFT0 : 2;
#endif
	} BIT;
	} TXSFTR;
	char           wk1[18908];
	unsigned char  TYPE;
	unsigned char  REVISION;
	unsigned short BUILD;
	unsigned char  FMMUNUM;
	unsigned char  SMNUM;
	unsigned char  RAMSIZE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char P0 : 2;
			unsigned char P1 : 2;
			unsigned char P2 : 2;
			unsigned char P3 : 2;
#else
			unsigned char P3 : 2;
			unsigned char P2 : 2;
			unsigned char P1 : 2;
			unsigned char P0 : 2;
#endif
	} BIT;
	} PORTDESC;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short FMMU : 1;
			unsigned short  : 1;
			unsigned short DC : 1;
			unsigned short DCWID : 1;
			unsigned short  : 2;
			unsigned short LINKDETMII : 1;
			unsigned short FCS : 1;
			unsigned short DCSYNC : 1;
			unsigned short LRW : 1;
			unsigned short RWSUPP : 1;
			unsigned short FSCONFIG : 1;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short FSCONFIG : 1;
			unsigned short RWSUPP : 1;
			unsigned short LRW : 1;
			unsigned short DCSYNC : 1;
			unsigned short FCS : 1;
			unsigned short LINKDETMII : 1;
			unsigned short  : 2;
			unsigned short DCWID : 1;
			unsigned short DC : 1;
			unsigned short  : 1;
			unsigned short FMMU : 1;
#endif
	} BIT;
	} FEATURE;
	char           wk2[6];
	unsigned short STATIONADR;
	unsigned short STATIONALIAS;
	char           wk3[12];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ENABLE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ENABLE : 1;
#endif
	} BIT;
	} REGWRENABLE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PROTECT : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char PROTECT : 1;
#endif
	} BIT;
	} REGWRPROTECT;
	char           wk4[14];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ENABLE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ENABLE : 1;
#endif
	} BIT;
	} ESCWRENABLE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PROTECT : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char PROTECT : 1;
#endif
	} BIT;
	} ESCWRPROTECT;
	char           wk5[14];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RESETECAT : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char RESETECAT : 2;
#endif
	} BIT;
	} ESCRESETECAT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RESETPDI : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char RESETPDI : 2;
#endif
	} BIT;
	} ESCRESETPDI;
	char           wk6[190];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FWDRULE : 1;
			unsigned long TEMPUSE : 1;
			unsigned long  : 6;
			unsigned long LP0 : 2;
			unsigned long LP1 : 2;
			unsigned long LP2 : 2;
			unsigned long LP3 : 2;
			unsigned long RXFIFO : 3;
			unsigned long  : 5;
			unsigned long STAALIAS : 1;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long STAALIAS : 1;
			unsigned long  : 5;
			unsigned long RXFIFO : 3;
			unsigned long LP3 : 2;
			unsigned long LP2 : 2;
			unsigned long LP1 : 2;
			unsigned long LP0 : 2;
			unsigned long  : 6;
			unsigned long TEMPUSE : 1;
			unsigned long FWDRULE : 1;
#endif
	} BIT;
	} ESCDLCONTROL;
	char           wk7[4];
	unsigned short PHYSICALRWOFST;
	char           wk8[6];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PDIOPE : 1;
			unsigned short PDIWDST : 1;
			unsigned short ENHLINKD : 1;
			unsigned short  : 1;
			unsigned short PHYP0 : 1;
			unsigned short PHYP1 : 1;
			unsigned short PHYP2 : 1;
			unsigned short PHYP3 : 1;
			unsigned short LP0 : 1;
			unsigned short COMP0 : 1;
			unsigned short LP1 : 1;
			unsigned short COMP1 : 1;
			unsigned short LP2 : 1;
			unsigned short COMP2 : 1;
			unsigned short LP3 : 1;
			unsigned short COMP3 : 1;
#else
			unsigned short COMP3 : 1;
			unsigned short LP3 : 1;
			unsigned short COMP2 : 1;
			unsigned short LP2 : 1;
			unsigned short COMP1 : 1;
			unsigned short LP1 : 1;
			unsigned short COMP0 : 1;
			unsigned short LP0 : 1;
			unsigned short PHYP3 : 1;
			unsigned short PHYP2 : 1;
			unsigned short PHYP1 : 1;
			unsigned short PHYP0 : 1;
			unsigned short  : 1;
			unsigned short ENHLINKD : 1;
			unsigned short PDIWDST : 1;
			unsigned short PDIOPE : 1;
#endif
	} BIT;
	} ESCDLSTATUS;
	char           wk9[14];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short INISTATE : 4;
			unsigned short ERRINDACK : 1;
			unsigned short DEVICEID : 1;
			unsigned short  : 10;
#else
			unsigned short  : 10;
			unsigned short DEVICEID : 1;
			unsigned short ERRINDACK : 1;
			unsigned short INISTATE : 4;
#endif
	} BIT;
	} ALCONTROL;
	char           wk10[14];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short ACTSTATE : 4;
			unsigned short ERR : 1;
			unsigned short DEVICEID : 1;
			unsigned short  : 10;
#else
			unsigned short  : 10;
			unsigned short DEVICEID : 1;
			unsigned short ERR : 1;
			unsigned short ACTSTATE : 4;
#endif
	} BIT;
	} ALSTATUS;
	char           wk11[2];
	unsigned short ALSTATUSCODE;
	char           wk12[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LEDCODE : 4;
			unsigned char OVERRIDEEN : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char OVERRIDEEN : 1;
			unsigned char LEDCODE : 4;
#endif
	} BIT;
	} RUNLEDOVERRIDE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LEDCODE : 4;
			unsigned char OVERRIDEEN : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char OVERRIDEEN : 1;
			unsigned char LEDCODE : 4;
#endif
	} BIT;
	} ERRLEDOVERRIDE;
	char           wk13[6];
	unsigned char  PDICONTROL;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DEVEMU : 1;
			unsigned char ENLALLP : 1;
			unsigned char DCSYNC : 1;
			unsigned char DCLATCH : 1;
			unsigned char ENLP0 : 1;
			unsigned char ENLP1 : 1;
			unsigned char ENLP2 : 1;
			unsigned char ENLP3 : 1;
#else
			unsigned char ENLP3 : 1;
			unsigned char ENLP2 : 1;
			unsigned char ENLP1 : 1;
			unsigned char ENLP0 : 1;
			unsigned char DCLATCH : 1;
			unsigned char DCSYNC : 1;
			unsigned char ENLALLP : 1;
			unsigned char DEVEMU : 1;
#endif
	} BIT;
	} ESCCONFIG;
	char           wk14[14];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ONCHIPBUSCLK : 5;
			unsigned char ONCHIPBUS : 3;
#else
			unsigned char ONCHIPBUS : 3;
			unsigned char ONCHIPBUSCLK : 5;
#endif
	} BIT;
	} PDICONFIG;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SYNC0OUT : 2;
			unsigned char SYNCLAT0 : 1;
			unsigned char SYNC0MAP : 1;
			unsigned char SYNC1OUT : 2;
			unsigned char SYNCLAT1 : 1;
			unsigned char SYNC1MAP : 1;
#else
			unsigned char SYNC1MAP : 1;
			unsigned char SYNCLAT1 : 1;
			unsigned char SYNC1OUT : 2;
			unsigned char SYNC0MAP : 1;
			unsigned char SYNCLAT0 : 1;
			unsigned char SYNC0OUT : 2;
#endif
	} BIT;
	} SYNCLATCHCONFIG;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DATABUSWID : 2;
			unsigned short  : 14;
#else
			unsigned short  : 14;
			unsigned short DATABUSWID : 2;
#endif
	} BIT;
	} EXTPDICONFIG;
	char           wk15[172];
	unsigned short ECATEVENTMASK;
	char           wk16[2];
	unsigned long  ALEVENTMASK;
	char           wk17[8];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DCLATCH : 1;
			unsigned short  : 1;
			unsigned short DLSTA : 1;
			unsigned short ALSTA : 1;
			unsigned short SMSTA0 : 1;
			unsigned short SMSTA1 : 1;
			unsigned short SMSTA2 : 1;
			unsigned short SMSTA3 : 1;
			unsigned short SMSTA4 : 1;
			unsigned short SMSTA5 : 1;
			unsigned short SMSTA6 : 1;
			unsigned short SMSTA7 : 1;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short SMSTA7 : 1;
			unsigned short SMSTA6 : 1;
			unsigned short SMSTA5 : 1;
			unsigned short SMSTA4 : 1;
			unsigned short SMSTA3 : 1;
			unsigned short SMSTA2 : 1;
			unsigned short SMSTA1 : 1;
			unsigned short SMSTA0 : 1;
			unsigned short ALSTA : 1;
			unsigned short DLSTA : 1;
			unsigned short  : 1;
			unsigned short DCLATCH : 1;
#endif
	} BIT;
	} ECATEVENTREQ;
	char           wk18[14];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ALCTRL : 1;
			unsigned long DCLATCH : 1;
			unsigned long DCSYNC0STA : 1;
			unsigned long DCSYNC1STA : 1;
			unsigned long SYNCACT : 1;
			unsigned long  : 1;
			unsigned long WDPD : 1;
			unsigned long  : 1;
			unsigned long SMINT0 : 1;
			unsigned long SMINT1 : 1;
			unsigned long SMINT2 : 1;
			unsigned long SMINT3 : 1;
			unsigned long SMINT4 : 1;
			unsigned long SMINT5 : 1;
			unsigned long SMINT6 : 1;
			unsigned long SMINT7 : 1;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long SMINT7 : 1;
			unsigned long SMINT6 : 1;
			unsigned long SMINT5 : 1;
			unsigned long SMINT4 : 1;
			unsigned long SMINT3 : 1;
			unsigned long SMINT2 : 1;
			unsigned long SMINT1 : 1;
			unsigned long SMINT0 : 1;
			unsigned long  : 1;
			unsigned long WDPD : 1;
			unsigned long  : 1;
			unsigned long SYNCACT : 1;
			unsigned long DCSYNC1STA : 1;
			unsigned long DCSYNC0STA : 1;
			unsigned long DCLATCH : 1;
			unsigned long ALCTRL : 1;
#endif
	} BIT;
	} ALEVENTREQ;
	char           wk19[220];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short INVFRMCNT : 8;
			unsigned short RXERRCNT : 8;
#else
			unsigned short RXERRCNT : 8;
			unsigned short INVFRMCNT : 8;
#endif
	} BIT;
	} RXERRCOUNT0;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short INVFRMCNT : 8;
			unsigned short RXERRCNT : 8;
#else
			unsigned short RXERRCNT : 8;
			unsigned short INVFRMCNT : 8;
#endif
	} BIT;
	} RXERRCOUNT1;
	char           wk20[4];
	unsigned char  FWDRXERRCOUNT0;
	unsigned char  FWDRXERRCOUNT1;
	char           wk21[2];
	unsigned char  EPUERRCOUNT;
	unsigned char  PDIERRCOUNT;
	char           wk22[2];
	unsigned char  LOSTLINKCOUNT0;
	unsigned char  LOSTLINKCOUNT1;
	char           wk23[238];
	unsigned short WDDIVIDE;
	char           wk24[14];
	unsigned short WDTPDI;
	char           wk25[14];
	unsigned short WDTDATA;
	char           wk26[30];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short WDSTAPD : 1;
			unsigned short  : 15;
#else
			unsigned short  : 15;
			unsigned short WDSTAPD : 1;
#endif
	} BIT;
	} WDSDATA;
	unsigned char  WDCDATA;
	unsigned char  WDCPDI;
	char           wk27[188];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CTRLPDI : 1;
			unsigned char FORCEECAT : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char FORCEECAT : 1;
			unsigned char CTRLPDI : 1;
#endif
	} BIT;
	} EEPCONF;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PDIACCESS : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char PDIACCESS : 1;
#endif
	} BIT;
	} EEPSTATE;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short ECATWREN : 1;
			unsigned short  : 5;
			unsigned short READBYTE : 1;
			unsigned short PROMSIZE : 1;
			unsigned short COMMAND : 3;
			unsigned short CKSUMERR : 1;
			unsigned short LOADSTA : 1;
			unsigned short ACKCMDERR : 1;
			unsigned short WRENERR : 1;
			unsigned short BUSY : 1;
#else
			unsigned short BUSY : 1;
			unsigned short WRENERR : 1;
			unsigned short ACKCMDERR : 1;
			unsigned short LOADSTA : 1;
			unsigned short CKSUMERR : 1;
			unsigned short COMMAND : 3;
			unsigned short PROMSIZE : 1;
			unsigned short READBYTE : 1;
			unsigned short  : 5;
			unsigned short ECATWREN : 1;
#endif
	} BIT;
	} EEPCONTSTAT;
	unsigned long  EEPADR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LODATA : 16;
			unsigned long HIDATA : 16;
#else
			unsigned long HIDATA : 16;
			unsigned long LODATA : 16;
#endif
	} BIT;
	} EEPDATA;
	char           wk28[4];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short WREN : 1;
			unsigned short PDICTRL : 1;
			unsigned short MILINK : 1;
			unsigned short PHYOFFSET : 5;
			unsigned short COMMAND : 2;
			unsigned short  : 3;
			unsigned short READERR : 1;
			unsigned short CMDERR : 1;
			unsigned short BUSY : 1;
#else
			unsigned short BUSY : 1;
			unsigned short CMDERR : 1;
			unsigned short READERR : 1;
			unsigned short  : 3;
			unsigned short COMMAND : 2;
			unsigned short PHYOFFSET : 5;
			unsigned short MILINK : 1;
			unsigned short PDICTRL : 1;
			unsigned short WREN : 1;
#endif
	} BIT;
	} MIICONTSTAT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PHYADDR : 5;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char PHYADDR : 5;
#endif
	} BIT;
	} PHYADR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PHYREGADDR : 5;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char PHYREGADDR : 5;
#endif
	} BIT;
	} PHYREGADR;
	unsigned short PHYDATA;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ACSMII : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ACSMII : 1;
#endif
	} BIT;
	} MIIECATACSSTAT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ACSMII : 1;
			unsigned char FORPDI : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char FORPDI : 1;
			unsigned char ACSMII : 1;
#endif
	} BIT;
	} MIIPDIACSSTAT;
	char           wk29[232];
	unsigned long  FMMU0LSTARTADR;
	unsigned short FMMU0LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTABIT : 3;
#endif
	} BIT;
	} FMMU0LSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTPBIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTPBIT : 3;
#endif
	} BIT;
	} FMMU0LSTOPBIT;
	unsigned short FMMU0PSTARTADR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PHYSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char PHYSTABIT : 3;
#endif
	} BIT;
	} FMMU0PSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char READ : 1;
			unsigned char WRITE : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char WRITE : 1;
			unsigned char READ : 1;
#endif
	} BIT;
	} FMMU0TYPE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ACTIVATE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ACTIVATE : 1;
#endif
	} BIT;
	} FMMU0ACT;
	char           wk30[3];
	unsigned long  FMMU1LSTARTADR;
	unsigned short FMMU1LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTABIT : 3;
#endif
	} BIT;
	} FMMU1LSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTPBIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTPBIT : 3;
#endif
	} BIT;
	} FMMU1LSTOPBIT;
	unsigned short FMMU1PSTARTADR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PHYSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char PHYSTABIT : 3;
#endif
	} BIT;
	} FMMU1PSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char READ : 1;
			unsigned char WRITE : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char WRITE : 1;
			unsigned char READ : 1;
#endif
	} BIT;
	} FMMU1TYPE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ACTIVATE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ACTIVATE : 1;
#endif
	} BIT;
	} FMMU1ACT;
	char           wk31[3];
	unsigned long  FMMU2LSTARTADR;
	unsigned short FMMU2LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTABIT : 3;
#endif
	} BIT;
	} FMMU2LSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTPBIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTPBIT : 3;
#endif
	} BIT;
	} FMMU2LSTOPBIT;
	unsigned short FMMU2PSTARTADR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PHYSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char PHYSTABIT : 3;
#endif
	} BIT;
	} FMMU2PSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char READ : 1;
			unsigned char WRITE : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char WRITE : 1;
			unsigned char READ : 1;
#endif
	} BIT;
	} FMMU2TYPE;
	union {
		unsigned char BYTE;
		struct {
			
